1s/ERP/Conf/Documents/Лико_УстановкаРезерваМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_УстановкаРезерваМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_РезервСерий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТекущейОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеПоНаработке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНастроечногоМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_УстановкаРезерваМатериалов/Ext/ManagerModule.bsl
Функция СтартСистемы() Экспорт  //+Лико m.shenderov 31.01.2023
	
	ДатаНачала=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаСистемыРезервированияПодКлиента.ЗначениеПараметра;
	
	Если ЗначениеЗаполнено(ДатаНачала) И ТипЗнч(ДатаНачала)=Тип("Дата") И ДатаНачала<ТекущаяДата() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //-Лико m.shenderov 31.01.2023 


Функция СтартРезевированияПодРегионы() Экспорт  //+Лико m.shenderov 31.01.2023
	
	ДатаНачала=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаРезервированияПодРегионы.ЗначениеПараметра;
	
	Если ЗначениеЗаполнено(ДатаНачала) И ТипЗнч(ДатаНачала)=Тип("Дата") И ДатаНачала<ТекущаяДата() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //-Лико m.shenderov 31.01.2023 




Процедура ПроверкаРезерваМатериалов(Отказ, РежимЗаписи,Партнер,Товары,ИмяТЗ="Товары",ИмяРеквизита="Номенклатура") Экспорт 
	
	Если Не СтартСистемы() Тогда
		Возврат;
	КонецЕсли;
	
	
	Если РежимЗаписи<>РежимЗаписиДокумента.Проведение  Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НомерСтроки=0;
	
		
	Для каждого Товар Из Товары Цикл 
		
				
			ОбъектНоменклатуры			=	Товар.Серия.ЯССМ_ОбъектНоменклатуры;
			ОбъектНоменклатуры_Партнер	=	ОбъектНоменклатуры.Партнер;
			Номенклатура				=   ОбъектНоменклатуры.Номенклатура;
			
			Если ЗначениеЗаполнено(ОбъектНоменклатуры_Партнер) И ОбъектНоменклатуры_Партнер<> Партнер Тогда
				Отказ				=	Истина;
				Сообщение 			= 	Новый СообщениеПользователю;
				
				Сообщение.Текст 	= 	СтрШаблон("Материал: №%3 (%1) - %2 - #%4, зарезервирован под заказы клиента: ""%5""!",
				Номенклатура.Код,
				Номенклатура,
				НомерСтроки+1,
				Формат(ОбъектНоменклатуры.НомерПоставки,"ЧДЦ=0; ЧГ="),
				ОбъектНоменклатуры_Партнер); 
				
				Сообщение.Поле = ИмяТЗ+"["+НомерСтроки+"]."+ИмяРеквизита; //имя реквизита
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Сообщить();
			КонецЕсли;
			
		

		НомерСтроки=НомерСтроки+1;

	КонецЦикла;



КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Лико_УстановкаРезерваМатериалов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Лико_УстановкаРезерваМатериалов.АвторДокумента,
	|	Лико_УстановкаРезерваМатериалов.Дата,
	|	Лико_УстановкаРезерваМатериалов.Комментарий,
	|	Лико_УстановкаРезерваМатериалов.Номер,
	|	Лико_УстановкаРезерваМатериалов.Организация,
	|	Лико_УстановкаРезерваМатериалов.Партнер,
	|	Лико_УстановкаРезерваМатериалов.РабочееМесто,
	|	Лико_УстановкаРезерваМатериалов.Склад,
	|	Лико_УстановкаРезерваМатериалов.Сотрудник,
	|	Лико_УстановкаРезерваМатериалов.Товары.(
	|		Номенклатура,
	|		Характеристика,
	|		Серия,
	|		КоличествоУпаковок,
	|		Количество,
	|		АдресХранения
	|	)
	|ИЗ
	|	Документ.Лико_УстановкаРезерваМатериалов КАК Лико_УстановкаРезерваМатериалов
	|ГДЕ
	|	Лико_УстановкаРезерваМатериалов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заголовок=?(Ссылка.Проведен,"Резерв материалов", "Отмена резерва материалов");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
